xml cf/InformationRegisters/НеЗагруженныеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НеЗагруженныеОбъекты</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтрокаОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml cf/InformationRegisters/НеЗагруженныеОбъекты/Ext/ManagerModule.bsl
&НаСервере
Процедура ДобавитьЗаписьОНезагруженномОбъекте(СтрокаОбработки, ИмяТаблицы, НомерСтека, ОписаниеОшибки) Экспорт
	
	Возврат;
	
	НаборЗаписей = РегистрыСведений.НеЗагруженныеОбъекты.СоздатьНаборЗаписей();
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	
	СтруктураСтека = Новый Структура;
	
	Для Каждого ТекКолонка Из СтрокаОбработки.Владелец().Колонки Цикл
		
		СтруктураСтека.Вставить(ТекКолонка.Имя);
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураСтека, СтрокаОбработки);
	
	ЗаписьНабора.СтрокаОбработки = ЗначениеВСтрокуВнутр(СтруктураСтека);
	ЗаписьНабора.ИмяТаблицы = ИмяТаблицы;
	ЗаписьНабора.НомерСтека = НомерСтека; 
	ЗаписьНабора.ОписаниеОшибки = ОписаниеОшибки;
	
	ЗаписьНабора.Период = ТекущаяДата();
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры
